tutoriels/tutoriel-org-mode.tex
% Created 2023-03-29 Wed 12:14
% Intended LaTeX compiler: pdflatex
% =================================BASE====================================%
\documentclass{article}
\usepackage[left=2cm,right=2cm,top=2cm,bottom=2cm]{geometry} % Marges
\usepackage[utf8]{inputenc} % Important pour symboles Francophones, é,à,etc.
\usepackage[T1]{fontenc} % Nécessaire avec FrenchBabel
\usepackage[french, american]{babel} % Environnements en Français.


\usepackage{amsmath, amssymb, amsthm} % Symb. math. (Mathmode+Textmode) + Beaux théorèmes.

\usepackage{mathtools, cancel} % Utilisation de boîtes \boxed{} + \cancelto{}{}
\usepackage{graphicx, wrapfig} % Géstion des figures.
\usepackage{hyperref} % Permettre l'utilisation d'hyperliens.
\usepackage{color} % Permettre l'utilisation des couleurs.
\usepackage[dvipsnames]{xcolor} % Couleurs avancées.
\usepackage{titling} % Donne accès à \theauthor, \thetitle, \thedate

% >>> Physique >>>
\usepackage{physics} % Meilleur package pour physicien. 
\usepackage{pxfonts} % Rajoute PLEIN de symboles mathématiques, dont les intégrales doubles et triples
% <<< Physique <<<

\usepackage{lipsum} % For fun
\usepackage{tikz} % Realisation de figures TIKZ.
\usepackage{natbib}
\bibliographystyle{plainnat}
% =================================BASE====================================%



% ================================SETTINGS=================================%
%%% - Pas d'indentation en début de paragraphe :
\setlength\parindent{0pt} 
%%% - Couleurs de hyperliens :
\hypersetup{colorlinks,urlcolor=cyan,citecolor=blue,linkcolor=teal}
%%% - Numéros d'équations suivent les sections :
\numberwithin{equation}{section} 
%%% - Les « captions » sont en italique :
\usepackage[textfont = it]{caption} 
% ================================SETTINGS=================================%



% ================================COMMANDS=================================%
% Degrés Celsius :
\newcommand{\celsius}{${}^\circ$ C} % \degrée Celsius : Pas mal plus simple qu'utilise le package gensymb qui plante avec tout...

% Vecteurs de base :
\newcommand{\nvf}{\hat{\vb{n}}}
\newcommand{\ivf}{\vb{\hat{i}}}
\newcommand{\jvf}{\hat{\vb{j}}}
\newcommand{\kvf}{\hat{\vb{k}}}

% ================================COMMANDS=================================%



% =================================ENTÊTE==================================%
\usepackage{fancyhdr}
\pagestyle{fancy}
\setlength{\headheight}{13pt}

\fancyhead[L]{$\cdot$\ \nouppercase{\leftmark} }
\fancyhead[R]{C.-É. Lizotte\ $\cdot$}
\fancyfoot[C] {$\cdot$ \thepage\ $\cdot$}
% =================================ENTÊTE==================================%
\author{Charles-Édouard Lizotte}
\date{29 mars 2023}
\title{Tutoriel de Org-Mode\\\medskip
\large Ta vie en joli texte}
\hypersetup{
 pdfauthor={Charles-Édouard Lizotte},
 pdftitle={Tutoriel de Org-Mode},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.6.2)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Fonctionnalités de l'écriture en org-mode}
\label{sec:org784ec7a}
\subsection{Délimiter les sous-sections}
\label{sec:orgf815e23}
Traditionnellement, dans le langage \textbf{Markdown}, on utilise le carré (\#) -- ce qui est particulièrement inquiétant selon moi.
En \textbf{Org-Mode}, on utilise plutôt les \textbf{double-triple-quadruple-étoiles}.
\subsubsection{Par exemple, ceci est une \textbf{sous-sous-section}\ldots{}}
\label{sec:org8ee5ccb}
\begin{enumerate}
\item Et ceci est une \textbf{sous-sous-sous-section}\ldots{}
\label{sec:org948b81b}
\end{enumerate}

\subsection{Texte en \textbf{gras}, \emph{italique} et \underline{sous-ligné}.}
\label{sec:orge8a9201}
Mettre du texte \textbf{en gras} à l'aide de \textbf{l'étoile de chaque côté}.\\[0pt]

Pour mettre du  en \emph{italique}, on utilise la commande "\emph{slash}" de chaque côté, de sorte que \emph{Ceci est en italique}.\\[0pt]

Finalement, pour \uline{sous-ligner} un bout de texte, on utilise évidement le symbole \emph{\uline{underscore}}.

\subsection{Créer des \href{https://www.youtube.com/watch?v=DLzxrzFCyOs\&t=1s}{URLs} et des liens symboliques}
\label{sec:orgf139374}
Il est aussi possible d'utiliser la commande \textbf{Ctrl-c + Ctrl-l} pour entrer un URL à partir du \emph{mini-buffer}. 
Par exemple, voici un URL qui mène tout droit vers \href{https://www.google.ca/}{Google}. \\[0pt]

Pour les \textbf{liens symboliques} vers des fichiers et des dossiers, on utilise la même technique que les URL, mais on ajoute \textbf{file} avec \textbf{Ctrl-C + Ctrld-L}. 
Par exemple, \textbf{Ctrl-C + Ctrl-L}, puis \textbf{file + RET} pour activer naviguation à partir du \emph{mini-buffer}.\\[0pt]

Prenons notre \emph{init file} comme un exemple :  \href{.emacs.d/init.el}{init file} !

\subsection{Citations et verbatim}
\label{sec:org6d36e50}
On peut toujours mettre du texte en verbatim à l'aide des commandes \textbf{\#+begin\textsubscript{quote} Test \#+end\textsubscript{quote}}.
Par exemple,
\begin{quote}
Blablabla.
\end{quote}
Par contre, il faut juste s'assurer que les \emph{begin} et \emph{end} sont sur le même niveau d'indentation. 

La même chose est possible lorsqu'on verbatime le texte provenant d'un bout de code,
Par exemple,
\begin{verbatim}
(setq douzaine 12)
\end{verbatim}

Bref, tout ça pour dire, les \textbf{\#+begin} servent bien à quelque chose.
Comme vous le verrez bientôt, on manque de verbatim dans nos vies. 

\section{Organisation du travail et divisions du texte}
\label{sec:orgd47a1ac}
\subsection{{\bfseries\sffamily TODO} Pour créer des \emph{TODO} list. [1/2]}
\label{sec:orge47ccc4}
On utlise en majuscule le \textbf{TODO}. Pour l'ajouter, mais il est bien plus amusant de jouer avec la commande \textbf{Ctrl-C + Ctrl-T} pour changer le statut d'une tâche.\\[0pt]

\textbf{Important}, quand on a des cases à cocher, on peut mettre un [/] à droite d'un titre pour suivre l'évolution des tâches, comme on peut le voir à droite de cette sous-section.
\begin{itemize}
\item[{$\boxtimes$}] tache 1
\item[{$\square$}] tache 2
\end{itemize}

\subsection{{\bfseries\sffamily DONE} Un fois une tâche accomplit, on change le statut pour \textbf{DONE}.}
\label{sec:org695fcfe}
Mais c'est aussi possible gosser avec \textbf{Maj-flêches} pour changer le statut
de la tâche.

\subsection{Création de tags\hfill{}\textsc{taglife}}
\label{sec:org2794dbb}
La commande \textbf{Ctrl-C + Ctrl-C} permet de créer un \emph{tag}, comme on peut le voir à droite de cette sous-section.

\subsection{Listes, énumérations numériques, alphabétiques et cases à cocher [1/3]}
\label{sec:orgaa6b01c}
Il est simple de créer une \textbf{liste de cases à cocher} à l'aide du symbole \textbf{boîte} et d'un tiret.
Par exemple,
\begin{itemize}
\item[{$\square$}] Ceci est un test avec les \emph{bullets};
\item[{$\boxtimes$}] Ceci aussi est une test;
\item[{$\square$}] Ceci aussi est un autre test pour illustrer l'importance des cases à cocher;
\begin{itemize}
\item[{$\square$}] On remplit et après on utilise \textbf{Ctrl-c (2x)} pour changer l'état de la tâche.
\end{itemize}
\end{itemize}

Il est aussi possible de créer des listes énumérant des items.
Par exemple,
\begin{enumerate}
\item blabla
\item Premier item
\begin{itemize}
\item a) Première lettre,
\item b) Deuxième lettre,
\end{itemize}
\item Retour aux chiffres. 
\begin{itemize}
\item Deuxième \emph{bulletpoint}, etc.
\item Le symbole \textbf{+} crée un \emph{bulletpoint}.
a. Première lettre
\end{itemize}
\item Bon, c'est le temps de terminer tout ça.
\end{enumerate}

\subsection{Planification à l'aide des \emph{Deadline}, \emph{timestamps}, et \emph{sheduled}}
\label{sec:orgb6a9a83}
\begin{itemize}
\item \textbf{Ctrl-C + Ctrl-D} : DEADLINE: \textit{<2023-03-05 Sun>}
\item \textbf{Ctrl-C + Ctrl-S} : SCHEDULED: \textit{<2021-04-12 Mon>}
\item Pour créer des \emph{timestamps} \textbf{Ctrl-c + '.'} : \textit{<2023-03-10 Fri 22:00>}
\end{itemize}

\section{Raccourcis clavier (\emph{Hotkeys}) importants}
\label{sec:orge9e8252}
\subsection{\textbf{M-flèche}}
\label{sec:org686c852}
Ça \emph{interchange} ton paragraphe de place et \textbf{ça permet de replacer les \emph{bulletlist}}.

\subsection{\textbf{Ctrl-c + Ctrl-t}}
\label{sec:org8f4d5b7}
Change ou applique un todo/done au niveau du titre.

\subsection{\textbf{Ctrl-c + Ctrl-c}}
\label{sec:org6851215}
Change l'état de quelque chose, comme une case à cocher, par exemple. 

\section{La beauté de \textbf{Org-Agenda}}
\label{sec:orgbacb422}
\subsection{Introduction}
\label{sec:orgd154dea}
Lors de la création d'une liste munie de \textbf{TODO}, la commande \textbf{M-x org-agenda} nous permet d'observer tous nos \textbf{TODO} à l'intérieur d'un \textbf{agenda}.
Cet accessoire est extrêmement utile, surtout lorsqu'on y associe des dates limite, des rendez-vous ou des \emph{timestamps}. 

\subsection{Ajouter le fichier à l'agenda}
\label{sec:org1e7f291}
Il est important de s'assurer que le fichier fait partie de notre liste de fichiers \emph{org-agenda}. 
Pour se faire, on peut effectuer la commande \textbf{M-x org-agenda-file-to-front}.
Par la suite, on peut refaire l'opération \textbf{M-x org-agenda} pour voir si tout fonctionne bien.
Après avoir joué dans l'agenda, il n'y a plus qu'à appuyer sur la touche \textbf{q} pour quitter le buffer.

\subsection{Org-Agenda est la gestion des dates}
\label{sec:org4e251d0}
Pour beaucoup d'internautes, la fonctionnalité \textbf{org-agenda} est litérallement la raison d'être de \textbf{org-mode}, d'où le slogan
\begin{quote}
Your life in plain text
\end{quote}

Gérer des dates n'aura jamais été aussi simple grace à (on se rapelle) ces trois fonctions : 
\begin{itemize}
\item a) \textbf{Ctrl-C .} -- Création d'un \emph{timestamp}; \textit{<2023-03-08 Wed>}
\item b) \textbf{Ctrl-c + Ctrl-d} -- Association d'un \emph{deadline} à notre item principal;
\item c) \textbf{Ctrl-c + Ctrl-s} -- Association d'une programation (\emph{shedule}) à notre item.
\end{itemize}

Rappelons aussi qu'il est utile de se mouvoir dans le calendrier à l'aide des touches \textbf{Maj-flêches}.
L'opération \textbf{Maj-flêche} est \textbf{aussi efficace sur la date dans le document org} lui-même.
Sinon, il est aussi possible de juste écrire la date et l'heure avec les indicatifs \textbf{AM} et \textbf{PM}.
Finalement, on se souvient qu'il est possible de faire \textbf{Ctrl-c + Ctrl-t} pour changer le statut d'une tâche en \textbf{Org-Mode}.
Cette dernière fonctionnalité est aussi \textbf{applicable à l'intérieur de l'agenda}. 

\section{Les tableaux}
\label{sec:org7a60501}


Pour réaliser un tableau, il faut seulement se servir de la barre verticale pour séparer des éléments quelconques. 
De sorte que,
\begin{center}
\begin{tabular}{llll}
\hline
\hline
\textbf{Ceci} & \textbf{est} & \textbf{un} & \textbf{tableau}\\[0pt]
\hline
Pronom & Verbe & Déterminant & Nom commun\\[0pt]
\hline
\hline
\end{tabular}
\end{center}
Ensuite, pour faire une ligne verticale, on utilise l'expression \textbf{|-} suivit de \textbf{Tab} pour créer une ligne. 
De la même manière qu'à l'intérieure du texte, on peut utiliser les expressions courantes, par exemple \textbf{M-Del}, \textbf{M-B}, etc.

\section{Citations en org-mode}
\label{sec:orga8127fc}
\subsection{Introduction et installation de \textbf{Org-cite}}
\label{sec:org8a30872}
En Org, il est possible de citer des  ouvrages provenant de fichiers \textbf{Bibtex}.
Il suffit d'avoir une version de Org plus récente que la \textbf{version 9.5}.
De base \textbf{Emacs} installe la version 9.3 en date de l'écriture de ce tutoriel.
Pour installer la bonne version de \textbf{Org} (soit \href{https://elpa.gnu.org/packages/org.html}{la plus récente}), il faut
\begin{enumerate}
\item Supprimer le dossier \href{file:///home/charles-edouard/.emacs.d/elta}{elpa} dans notre dossier \href{file:///home/charles-edouard/.emacs.d}{.emacs.d}.
Ceci aura l'effet de tout supprimer les \emph{packages} installés, mais ce n'est pas très grave, \textbf{Emacs} s'occupera lui-même de les installer (\emph{minor inconvenience}).
\item Ré-ouvrir emacs en mode -Q justement pour empêcher \textbf{Emacs} d'installer n'importe quel \emph{package} de base sans notre consentement avant qu'on installe \textbf{Org};
\item Utiliser la commande \textbf{M-x package-install} et trouver \textbf{Org} + \textbf{RET} pour installer la dernière version de \textbf{Org}.
\end{enumerate}
Une fois ces trois tâches accomplit, on peut redémarer \textbf{Emacs} normalement et ouvrir un fichier \textbf{Org}.\\[0pt]

Pour plus d'info, le lecteur est invité à lire les articles
\begin{itemize}
\item \href{https://blog.tecosaur.com/tmio/2021-07-31-citations.html}{This Month in Org : Introducing citations!}
\item \href{https://kristofferbalintona.me/posts/202206141852/}{Citations in org-mode: Org-cite and Citar}
\end{itemize}

\subsection{Utilisation}
\label{sec:orge8871e6}
Pour utiliser \textbf{Org-cite}, le lecteur est invité à utiliser la commande
\textbf{M-x org-cite-insert} et de jouer là-dedans.
Sinon, la terminologie à utilier est (, ). 
\end{document}